#### Weighted Mean

##### Engineering Exam

-   History - 90
-   Math - 35
-   Physics -38

In [1]:
print(163/3)

54.333333333333336

In [15]:
import pandas as pd
score = pd.DataFrame(data = [['harry','history',1,30],['harry','math',2,85],['harry','physics',3,88]],
                     columns = ['name','subject','weightage','marks'])

In [16]:
score

    name  subject  weightage  marks
0  harry  history          1     30
1  harry     math          2     85
2  harry  physics          3     88

In [17]:
print(sum(score['marks'])/3)

67.66666666666667

In [18]:
weighted_score_summation = sum(score['weightage']*score['marks'])
print(weighted_score_summation)

464

In [19]:
weighted_summation = sum(score['weightage'])
print(weighted_summation)

6

In [20]:
print(f'the weighted average is {weighted_score_summation/weighted_summation}')

the weighted average is 77.33333333333333

##### Trimmed Mean

In [48]:
salary = pd.DataFrame(data = [['CEO',80000],
                              ['Jr Associate',3000],
                              ['Associate 2',25000],
                              ['Associate 3',26500],
                              ['Associate 4',21500],
                              ['Associate 5',23000],
                              ['Associate 6',25000],
                              ['Associate 7',26500],
                              ['Associate 14',25400],
                              ['Associate 8',23000],
                              ['Associate 9',25000],
                              ['Associate 10',26500],
                              ['Jr Associate ',4500],
                              ['Associate 15',23200],
                              ['Associate 12',25000],
                              ['Associate 13',26500],
                              ['VP',75500]],columns = ['Designation','Salary'])

In [49]:
salary

      Designation  Salary
0             CEO   80000
1    Jr Associate    3000
2     Associate 2   25000
3     Associate 3   26500
4     Associate 4   21500
5     Associate 5   23000
6     Associate 6   25000
7     Associate 7   26500
8    Associate 14   25400
9     Associate 8   23000
10    Associate 9   25000
11   Associate 10   26500
12  Jr Associate     4500
13   Associate 15   23200
14   Associate 12   25000
15   Associate 13   26500
16             VP   75500

In [50]:
print(salary['Salary'].mean())

28535.29411764706

In [51]:
trim_len = len(salary['Salary'])

In [52]:
print(trim_len)

17

In [53]:
trim_per = 0.25

In [54]:
trim_len_20_per = round(trim_len*trim_per)
print(trim_len_20_per)

4

In [55]:
s2 = salary['Salary'].nsmallest(2)
l2 = salary['Salary'].nlargest(2)

In [56]:
print(s2)

1     3000
12    4500
Name: Salary, dtype: int64

In [57]:
print(l2)

0     80000
16    75500
Name: Salary, dtype: int64

In [58]:
update_salary = salary.drop([1,12,0,16],axis = 0)

In [59]:
print(salary['Salary'].mean())
print(update_salary['Salary'].mean())

28535.29411764706
24776.923076923078

##### Mean Absolute Deviation

In [61]:
import numpy as np

In [62]:
marks = pd.DataFrame(data= [['Harry',65],
                            ['Ron',75],
                            ['Fred',74],
                            ['George',55],
                            ['Neville',85]],columns = ['Name','Score'])

In [63]:
marks

      Name  Score
0    Harry     65
1      Ron     75
2     Fred     74
3   George     55
4  Neville     85

In [64]:
marks_avg = round(np.mean(marks['Score']))
print(marks_avg)

71

In [65]:
diff_lst = []
for i in marks.Score:
    diff_lst.append(abs(marks_avg-i))

In [66]:
diff_lst

[6, 4, 3, 16, 14]

In [67]:
print(f'the mean absolute deviation is {round(np.mean(diff_lst))}')

the mean absolute deviation is 9

In [69]:
print(f"the mean absolute deviation is {round(marks['Score'].mad())}")

the mean absolute deviation is 9

#### Standard Deviation

In [70]:
diff_lst1 = []
for i in marks.Score:
    diff_lst1.append((abs(marks_avg-i))**2)
diff_lst1

[36, 16, 9, 256, 196]

In [71]:
diff_lst

[6, 4, 3, 16, 14]

In [72]:
avg_mean_marks = round(np.mean(diff_lst1))

In [73]:
print(f'the standard deviation is {int(np.sqrt(avg_mean_marks))}')

the standard deviation is 10

In [75]:
import statistics
print(f'the standard deviation is {int(statistics.stdev(marks["Score"]))}')

the standard deviation is 11